<?php

error_reporting(-1);

$code = array(
  'а' => 'g',
  'б' => 'w',
  'в' => 'y',
  'г' => 'h',
  'д' => 'k',
  'е' => 'z',
  'ж' => 'b',
  'з' => 'n',
  'и' => 'u',
  'й' => 'm',
  'к' => '4',
  'л' => '1u',
  'м' => '5',
  'н' => '9',
  'о' => '0',
  'п' => 'lt',
  'р' => 'o',
  'с' => 't',
  'т' => 'v',
  'у' => 'd',
  'ф' => 's',
  'х' => '2',
  'у' => 'r',
  'ч' => 'e',
  'щ' => '7',
  'ь' => '8e',
  'ы' => 'p',
  'й' => 'x',
  'э' => 'c',
  'ю' => 'j',
  'я' => '6',
);

$text = "Сходан боевой классики - в 18.00 у дк техстекло";
$chiper = strtr($text, $code);
$flipped = array_flip($code);
$dechiper = strtr($chiper, $flipped);


echo "{$chiper}\n {$dechiper}";

 ?>
